{
  "locations": [
    {
      "id": 1,
      "name": "Dorm Room",
      "brief_description": "You are back in your dorm room. Your desk is cluttered with papers. You can go to the Hallway North.",
      "long_description": "You are in your dorm room. It's a mess of textbooks and empty coffee cups. Your laptop sits on the desk, battery draining. This is where you need to return your missing items to finish your project. The deadline is looming! You can leave to the Hallway North.",
      "available_commands": {
        "go north": 2
      },
      "items": ["t_card"]
    },
    {
      "id": 2,
      "name": "Hallway",
      "brief_description": "You are in the residence hallway. It's quiet. You can return to your Dorm South, or head outside to University College East.",
      "long_description": "You stand in the long, quiet hallway of your residence building. You see a few other students rushing to class. To the South is your Dorm Room. To the East, the exit leads out to University College.",
      "available_commands": {
        "go south": 1,
        "go east": 3
      },
      "items": []
    },
    {
      "id": 3,
      "name": "University College",
      "brief_description": "You are at University College. Historical buildings surround the green. You can go West to the Hallway, North to Robarts Library, or South to the Bahen Centre.",
      "long_description": "You stand in the quad of University College. The historic stone building looms over you. Students are relaxing on the grass. To the West is your Residence Hallway. To the North is the massive concrete turkey, Robarts Library. To the South is the Bahen Centre for Information Technology.",
      "available_commands": {
        "go west": 2,
        "go north": 4,
        "go south": 5
      },
      "items": []
    },
    {
      "id": 4,
      "name": "Robarts Library",
      "brief_description": "You are in Robarts Library. It's silent. You can return South to University College or go East to the CSC111 Lecture Room.",
      "long_description": "You enter Robarts Library. The silence is heavy, and the brutalist architecture is imposing. You remember working at a table near the back. The exit to University College is South. A connecting corridor leads East to the CSC111 Lecture Room.",
      "available_commands": {
        "go south": 3,
        "go east": 6
      },
      "items": ["usb_drive"],
      "locked": true,
      "key_id": 4
    },
    {
      "id": 5,
      "name": "Bahen Centre",
      "brief_description": "You are in the Bahen Centre atrium. It's buzzing with CS students. You can return North to University College or go Down to the basement.",
      "long_description": "You walk into the Bahen Centre. It's bright and modern, buzzing with students coding on their specific CS assignments. You see the corner table where you and your friend were working yesterday. On the floor near the stairwell, you notice something glinting. You can return North to University College or descend Down to the basement.",
      "available_commands": {
        "go north": 3,
        "go down": 7
      },
      "items": ["laptop_charger", "server_room_key"]
    },
    {
      "id": 6,
      "name": "CSC111 Lecture Room",
      "brief_description": "You are in the CSC111 Lecture Room. It's empty. You can return West to Robarts Library.",
      "long_description": "You stand in the CSC111 Lecture Room. The rows of seats are empty between classes. You check under the seat where you sat during the last lecture. The exit West takes you back to Robarts Library.",
      "available_commands": {
        "go west": 4
      },
      "items": ["lucky_mug"]
    },
    {
      "id": 7,
      "name": "Secret Server Room",
      "brief_description": "You are in a hidden server room. Rows of blinking servers hum quietly. You can return Up to Bahen Centre.",
      "long_description": "You descend into a dimly lit basement server room. Rows upon rows of servers blink with activity, their cooling fans creating a steady hum. In the corner, someone has carelessly left something on a desk... The exit leads Up to Bahen Centre.",
      "available_commands": {
        "go up": 5
      },
      "items": ["open_ai_api_key"],
      "locked": true,
      "key_id": 6
    }
  ],
  "items": [
    {
      "id": 1,
      "name": "usb_drive",
      "description": "Your USB drive containing the only backup of your project. Crucial!",
      "can_take": true,
      "target_position": 1,
      "target_points": 50
    },
    {
      "id": 2,
      "name": "laptop_charger",
      "description": "Your laptop charger. You won't be able to submit your project without power!",
      "can_take": true,
      "target_position": 1,
      "target_points": 30
    },
    {
      "id": 3,
      "name": "lucky_mug",
      "description": "Your lucky UofT mug. It has seen you through every deadline. You can't submit without it.",
      "can_take": true,
      "target_position": 1,
      "target_points": 20
    },
    {
      "id": 4,
      "name": "t_card",
      "description": "Your Student T-Card. You need this to access library buildings.",
      "can_take": true,
      "target_position": 1,
      "target_points": 0
    },
    {
      "id": 5,
      "name": "open_ai_api_key",
      "description": "A mysterious API key someone left behind. It grants access to powerful AI tools... but at what cost?",
      "can_take": true,
      "target_position": 1,
      "target_points": 0
    },
    {
      "id": 6,
      "name": "server_room_key",
      "description": "A metal key labeled 'SERVER ROOM - AUTHORIZED ACCESS ONLY'. Someone must have dropped this.",
      "can_take": true,
      "target_position": 1,
      "target_points": 0
    }
  ]
}
